README.md

# Table of Contents

1.  [Nome do Software (ou Biblioteca):](#org400727f)
2.  [Resumo e/ou informação extra:](#orga3d79f7)
3.  [Versão:](#orgbd1dc0e)
4.  [Data:](#org7f360c1)
5.  [Autor de Contato:](#org6761cf3)
6.  [Lista dos Autores:](#org57f7571)
7.  [Áreas de pesquisa vinculadas:](#org33440a4)
8.  [Vinculo com:](#orga8f6edb)
9.  [Paradigmas:](#org2ad91f6)
10. [Tipo de Interface:](#orge20ce0f)
11. [Plataformas Suportadas:](#org58b0343)
12. [Linguagens Utilizadas:](#org1f2da84)
13. [Bibliotecas Utilizadas (dependências):](#org350adce)
14. [Softwares utilizados (dependências)](#orgfb3e3c6)
15. [Tipo de Licença:](#orgc974ffb)
16. [Links:](#org1cd3e71)


<a id="org400727f"></a>

# Nome do Software (ou Biblioteca):

-   DESENVOLVIMENTO DO SOFTWARE CARACTERIZAÇÃO DE RESERVATÓRIOS INTEGRADO À ANÁLISE PETROFÍSICA
-   ProjetoEngenharia-SoftwareCaracterizacaoDeReservatoriosIntegradoAAnalisePetrofisica


<a id="orga3d79f7"></a>

# Resumo e/ou informação extra:

-   Criar um software capaz de calcular parâmetros e inferir características de

um reservatório, através da análise dos dados obtidos em testes de pressão em
poços e na testemunhagem do reservatório, possibilitando estimar as dimensões
do campo e sua potencialidade econômica. Um diferencial importante nesta
versão é a flexíbilidade na entrada de dados do usuário.


<a id="orgbd1dc0e"></a>

# Versão:

-   2.0.


<a id="org7f360c1"></a>

# Data:

-   2014/2 - segundo semestre.


<a id="org6761cf3"></a>

# Autor de Contato:

-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org57f7571"></a>

# Lista dos Autores:

-   ALEXANDRE LISBOA BASTOS JUNIOR - VERSÃO 2 (2014/2)
-   JOÃO VITOR MARINHO DA COSTA NEVES - VERSÃO 2 (2014/2)
-   MAXIMIANO KANDA FERRAZ - VERSÃO 1 (2012/2)
-   GABRIEL VASCONCELOS DE SOUSA - VERSÃO 1 (2012/2)
-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org33440a4"></a>

# Áreas de pesquisa vinculadas:

-   Modelagem Matemática Computacional
-   Engenharia Reservatório


<a id="orga8f6edb"></a>

# Vinculo com:

-   Trabalho da disciplina de programação prática.


<a id="org2ad91f6"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="orge20ce0f"></a>

# Tipo de Interface:

-   Terminal e gráfica (gnuplot).


<a id="org58b0343"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="org1f2da84"></a>

# Linguagens Utilizadas:

-   C++ 11.


<a id="org350adce"></a>

# Bibliotecas Utilizadas (dependências):

-   CGnuplot - <https://github.com/ldsc/CGnuplot>


<a id="orgfb3e3c6"></a>

# Softwares utilizados (dependências)

-   gnuplot <http://www.gnuplot.info/>


<a id="orgc974ffb"></a>

# Tipo de Licença:

-   GPL
-   Entre em contato com o Prof. André Duarte Bueno
    andreduartebueno@gmail.com
    para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
-   Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.


<a id="org1cd3e71"></a>

# Links:

